Revit 2024 API
StructuralSettings.BraceAboveSymbol Property
 The id of the ElementType to represent a brace above a beam in plan view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId BraceAboveSymbol { get; set; }
Visual Basic
Public Property BraceAboveSymbol As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BraceAboveSymbol {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace